jmeter/valid_vehicle_compliance.yml
execution:
- concurrency: 1
  hold-for: 30s
  scenario: validCompliance


scenarios:
  validCompliance:
    default-address: http://vccs-web-dev-1715195167.eu-west-2.elb.amazonaws.com
    requests:
      - /air_zones/compliance?vrn=CU57ABC&caz%5B%5D=birmingham&caz%5B%5D=leeds

reporting:
- module: passfail
  criteria:
  - "avg-rt>500ms for 10s, continue as failed"
  - "fail>50% for 1s, stop as failed"